keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEth_bf.h
/** \\brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX65T127OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX65T127OCTGBFIS_OFF (12)

/** \\brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXALGNERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXALGNERFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXALGNERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXALGNERFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXALGNERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXALGNERFIS_OFF (6)

/** \\brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXBCGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXBCGFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXBCGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXBCGFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXBCGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXBCGFIS_OFF (3)

/** \\brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXCRCERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXCRCERFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXCRCERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXCRCERFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXCRCERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXCRCERFIS_OFF (5)

/** \\brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXCTRLFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXCTRLFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXCTRLFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXCTRLFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXCTRLFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXCTRLFIS_OFF (25)

/** \\brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXFOVFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXFOVFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXFOVFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXFOVFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXFOVFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXFOVFIS_OFF (21)

/** \\brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXGBFRMIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXGBFRMIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXGBFRMIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXGBFRMIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXGBFRMIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXGBFRMIS_OFF (0)

/** \\brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXGBOCTIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXGBOCTIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXGBOCTIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXGBOCTIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXGBOCTIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXGBOCTIS_OFF (1)

/** \\brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXGOCTIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXGOCTIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXGOCTIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXGOCTIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXGOCTIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXGOCTIS_OFF (2)

/** \\brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXJABERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXJABERFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXJABERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXJABERFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXJABERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXJABERFIS_OFF (8)

/** \\brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXLENERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXLENERFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXLENERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXLENERFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXLENERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXLENERFIS_OFF (18)

/** \\brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXMCGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXMCGFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXMCGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXMCGFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXMCGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXMCGFIS_OFF (4)

/** \\brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXORANGEFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXORANGEFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXORANGEFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXORANGEFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXORANGEFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXORANGEFIS_OFF (19)

/** \\brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXOSIZEGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXOSIZEGFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXOSIZEGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXOSIZEGFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXOSIZEGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXOSIZEGFIS_OFF (10)

/** \\brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXPAUSFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXPAUSFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXPAUSFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXPAUSFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXPAUSFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXPAUSFIS_OFF (20)

/** \\brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXRCVERRFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXRCVERRFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXRCVERRFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXRCVERRFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXRCVERRFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXRCVERRFIS_OFF (24)

/** \\brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXRUNTFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXRUNTFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXRUNTFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXRUNTFIS_MSK (0x1)

