keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEth_bf.h
/** \\brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXUFLOWERFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXUFLOWERFIM_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXUFLOWERFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXUFLOWERFIM_OFF (13)

/** \\brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXVLANGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXVLANGFIM_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXVLANGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXVLANGFIM_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXVLANGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXVLANGFIM_OFF (24)

/** \\brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX1024TMAXOCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX1024TMAXOCTGBFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX1024TMAXOCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX1024TMAXOCTGBFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX1024TMAXOCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX1024TMAXOCTGBFIS_OFF (9)

/** \\brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX128T255OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX128T255OCTGBFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX128T255OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX128T255OCTGBFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX128T255OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX128T255OCTGBFIS_OFF (6)

/** \\brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX256T511OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX256T511OCTGBFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX256T511OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX256T511OCTGBFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX256T511OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX256T511OCTGBFIS_OFF (7)

/** \\brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX512T1023OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX512T1023OCTGBFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX512T1023OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX512T1023OCTGBFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX512T1023OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX512T1023OCTGBFIS_OFF (8)

/** \\brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX64OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX64OCTGBFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX64OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX64OCTGBFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX64OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX64OCTGBFIS_OFF (4)

/** \\brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX65T127OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX65T127OCTGBFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX65T127OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX65T127OCTGBFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX65T127OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX65T127OCTGBFIS_OFF (5)

/** \\brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXBCGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXBCGBFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXBCGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXBCGBFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXBCGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXBCGBFIS_OFF (12)

/** \\brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXBCGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXBCGFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXBCGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXBCGFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXBCGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXBCGFIS_OFF (2)

/** \\brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXCARERFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXCARERFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXCARERFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXCARERFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXCARERFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXCARERFIS_OFF (19)

/** \\brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXDEFFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXDEFFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXDEFFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXDEFFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXDEFFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXDEFFIS_OFF (16)

/** \\brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXEXCOLFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXEXCOLFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXEXCOLFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXEXCOLFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXEXCOLFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXEXCOLFIS_OFF (18)

/** \\brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXEXDEFFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXEXDEFFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXEXDEFFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXEXDEFFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXEXDEFFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXEXDEFFIS_OFF (22)

/** \\brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGBFRMIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGBFRMIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGBFRMIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGBFRMIS_MSK (0x1)

