keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEth_bf.h
/** \\brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGBFRMIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGBFRMIS_OFF (1)

/** \\brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGBOCTIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGBOCTIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGBOCTIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGBOCTIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGBOCTIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGBOCTIS_OFF (0)

/** \\brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGFRMIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGFRMIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGFRMIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGFRMIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGFRMIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGFRMIS_OFF (21)

/** \\brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGOCTIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGOCTIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGOCTIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGOCTIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGOCTIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGOCTIS_OFF (20)

/** \\brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXLATCOLFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXLATCOLFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXLATCOLFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXLATCOLFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXLATCOLFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXLATCOLFIS_OFF (17)

/** \\brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXMCGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXMCGBFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXMCGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXMCGBFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXMCGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXMCGBFIS_OFF (11)

/** \\brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXMCGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXMCGFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXMCGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXMCGFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXMCGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXMCGFIS_OFF (3)

/** \\brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXMCOLGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXMCOLGFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXMCOLGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXMCOLGFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXMCOLGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXMCOLGFIS_OFF (15)

/** \\brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXOSIZEGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXOSIZEGFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXOSIZEGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXOSIZEGFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXOSIZEGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXOSIZEGFIS_OFF (25)

/** \\brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXPAUSFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXPAUSFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXPAUSFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXPAUSFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXPAUSFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXPAUSFIS_OFF (23)

/** \\brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXSCOLGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXSCOLGFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXSCOLGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXSCOLGFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXSCOLGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXSCOLGFIS_OFF (14)

/** \\brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXUCGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXUCGBFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXUCGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXUCGBFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXUCGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXUCGBFIS_OFF (10)

/** \\brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXUFLOWERFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXUFLOWERFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXUFLOWERFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXUFLOWERFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXUFLOWERFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXUFLOWERFIS_OFF (13)

/** \\brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXVLANGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXVLANGFIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXVLANGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXVLANGFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXVLANGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXVLANGFIS_OFF (24)

/** \\brief  Length for Ifx_ETH_OPERATION_MODE_Bits.DFF */
#define IFX_ETH_OPERATION_MODE_DFF_LEN (1)

/** \\brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.DFF */
#define IFX_ETH_OPERATION_MODE_DFF_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.DFF */
#define IFX_ETH_OPERATION_MODE_DFF_OFF (24)

/** \\brief  Length for Ifx_ETH_OPERATION_MODE_Bits.DT */
#define IFX_ETH_OPERATION_MODE_DT_LEN (1)

/** \\brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.DT */
#define IFX_ETH_OPERATION_MODE_DT_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.DT */
#define IFX_ETH_OPERATION_MODE_DT_OFF (26)

/** \\brief  Length for Ifx_ETH_OPERATION_MODE_Bits.EFC */
#define IFX_ETH_OPERATION_MODE_EFC_LEN (1)

/** \\brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.EFC */
#define IFX_ETH_OPERATION_MODE_EFC_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.EFC */
#define IFX_ETH_OPERATION_MODE_EFC_OFF (8)

/** \\brief  Length for Ifx_ETH_OPERATION_MODE_Bits.FEF */
#define IFX_ETH_OPERATION_MODE_FEF_LEN (1)

/** \\brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.FEF */
#define IFX_ETH_OPERATION_MODE_FEF_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.FEF */
#define IFX_ETH_OPERATION_MODE_FEF_OFF (7)

/** \\brief  Length for Ifx_ETH_OPERATION_MODE_Bits.FTF */
#define IFX_ETH_OPERATION_MODE_FTF_LEN (1)

/** \\brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.FTF */
#define IFX_ETH_OPERATION_MODE_FTF_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.FTF */
#define IFX_ETH_OPERATION_MODE_FTF_OFF (20)

/** \\brief  Length for Ifx_ETH_OPERATION_MODE_Bits.FUF */
#define IFX_ETH_OPERATION_MODE_FUF_LEN (1)

/** \\brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.FUF */
#define IFX_ETH_OPERATION_MODE_FUF_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.FUF */
#define IFX_ETH_OPERATION_MODE_FUF_OFF (6)

/** \\brief  Length for Ifx_ETH_OPERATION_MODE_Bits.OSF */
#define IFX_ETH_OPERATION_MODE_OSF_LEN (1)

/** \\brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.OSF */
#define IFX_ETH_OPERATION_MODE_OSF_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.OSF */
#define IFX_ETH_OPERATION_MODE_OSF_OFF (2)

