keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEth_bf.h
/** \\brief  Offset for
 * Ifx_ETH_RX_512TO1023OCTETS_FRAMES_GOOD_BAD_Bits.RX512_1023OCTGB */
#define IFX_ETH_RX_512TO1023OCTETS_FRAMES_GOOD_BAD_RX512_1023OCTGB_OFF (0)

/** \\brief  Length for Ifx_ETH_RX_64OCTETS_FRAMES_GOOD_BAD_Bits.RX64OCTGB */
#define IFX_ETH_RX_64OCTETS_FRAMES_GOOD_BAD_RX64OCTGB_LEN (32)

/** \\brief  Mask for Ifx_ETH_RX_64OCTETS_FRAMES_GOOD_BAD_Bits.RX64OCTGB */
#define IFX_ETH_RX_64OCTETS_FRAMES_GOOD_BAD_RX64OCTGB_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RX_64OCTETS_FRAMES_GOOD_BAD_Bits.RX64OCTGB */
#define IFX_ETH_RX_64OCTETS_FRAMES_GOOD_BAD_RX64OCTGB_OFF (0)

/** \\brief  Length for
 * Ifx_ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD_Bits.RX65_127OCTGB */
#define IFX_ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD_RX65_127OCTGB_LEN (32)

/** \\brief  Mask for
 * Ifx_ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD_Bits.RX65_127OCTGB */
#define IFX_ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD_RX65_127OCTGB_MSK (0xffffffff)

/** \\brief  Offset for
 * Ifx_ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD_Bits.RX65_127OCTGB */
#define IFX_ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD_RX65_127OCTGB_OFF (0)

/** \\brief  Length for Ifx_ETH_RX_ALIGNMENT_ERROR_FRAMES_Bits.RXALGNERR */
#define IFX_ETH_RX_ALIGNMENT_ERROR_FRAMES_RXALGNERR_LEN (32)

/** \\brief  Mask for Ifx_ETH_RX_ALIGNMENT_ERROR_FRAMES_Bits.RXALGNERR */
#define IFX_ETH_RX_ALIGNMENT_ERROR_FRAMES_RXALGNERR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RX_ALIGNMENT_ERROR_FRAMES_Bits.RXALGNERR */
#define IFX_ETH_RX_ALIGNMENT_ERROR_FRAMES_RXALGNERR_OFF (0)

/** \\brief  Length for Ifx_ETH_RX_BROADCAST_FRAMES_GOOD_Bits.RXBCASTG */
#define IFX_ETH_RX_BROADCAST_FRAMES_GOOD_RXBCASTG_LEN (32)

/** \\brief  Mask for Ifx_ETH_RX_BROADCAST_FRAMES_GOOD_Bits.RXBCASTG */
#define IFX_ETH_RX_BROADCAST_FRAMES_GOOD_RXBCASTG_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RX_BROADCAST_FRAMES_GOOD_Bits.RXBCASTG */
#define IFX_ETH_RX_BROADCAST_FRAMES_GOOD_RXBCASTG_OFF (0)

/** \\brief  Length for Ifx_ETH_RX_CONTROL_FRAMES_GOOD_Bits.RXCTRLG */
#define IFX_ETH_RX_CONTROL_FRAMES_GOOD_RXCTRLG_LEN (32)

/** \\brief  Mask for Ifx_ETH_RX_CONTROL_FRAMES_GOOD_Bits.RXCTRLG */
#define IFX_ETH_RX_CONTROL_FRAMES_GOOD_RXCTRLG_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RX_CONTROL_FRAMES_GOOD_Bits.RXCTRLG */
#define IFX_ETH_RX_CONTROL_FRAMES_GOOD_RXCTRLG_OFF (0)

/** \\brief  Length for Ifx_ETH_RX_CRC_ERROR_FRAMES_Bits.RXCRCERR */
#define IFX_ETH_RX_CRC_ERROR_FRAMES_RXCRCERR_LEN (32)

/** \\brief  Mask for Ifx_ETH_RX_CRC_ERROR_FRAMES_Bits.RXCRCERR */
#define IFX_ETH_RX_CRC_ERROR_FRAMES_RXCRCERR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RX_CRC_ERROR_FRAMES_Bits.RXCRCERR */
#define IFX_ETH_RX_CRC_ERROR_FRAMES_RXCRCERR_OFF (0)

/** \\brief  Length for Ifx_ETH_RX_FIFO_OVERFLOW_FRAMES_Bits.RXFIFOOVFL */
#define IFX_ETH_RX_FIFO_OVERFLOW_FRAMES_RXFIFOOVFL_LEN (32)

/** \\brief  Mask for Ifx_ETH_RX_FIFO_OVERFLOW_FRAMES_Bits.RXFIFOOVFL */
#define IFX_ETH_RX_FIFO_OVERFLOW_FRAMES_RXFIFOOVFL_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RX_FIFO_OVERFLOW_FRAMES_Bits.RXFIFOOVFL */
#define IFX_ETH_RX_FIFO_OVERFLOW_FRAMES_RXFIFOOVFL_OFF (0)

/** \\brief  Length for Ifx_ETH_RX_FRAMES_COUNT_GOOD_BAD_Bits.RXFRMGB */
#define IFX_ETH_RX_FRAMES_COUNT_GOOD_BAD_RXFRMGB_LEN (32)

/** \\brief  Mask for Ifx_ETH_RX_FRAMES_COUNT_GOOD_BAD_Bits.RXFRMGB */
#define IFX_ETH_RX_FRAMES_COUNT_GOOD_BAD_RXFRMGB_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RX_FRAMES_COUNT_GOOD_BAD_Bits.RXFRMGB */
#define IFX_ETH_RX_FRAMES_COUNT_GOOD_BAD_RXFRMGB_OFF (0)

/** \\brief  Length for Ifx_ETH_RX_JABBER_ERROR_FRAMES_Bits.RXJABERR */
#define IFX_ETH_RX_JABBER_ERROR_FRAMES_RXJABERR_LEN (32)

/** \\brief  Mask for Ifx_ETH_RX_JABBER_ERROR_FRAMES_Bits.RXJABERR */
#define IFX_ETH_RX_JABBER_ERROR_FRAMES_RXJABERR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RX_JABBER_ERROR_FRAMES_Bits.RXJABERR */
#define IFX_ETH_RX_JABBER_ERROR_FRAMES_RXJABERR_OFF (0)

/** \\brief  Length for Ifx_ETH_RX_LENGTH_ERROR_FRAMES_Bits.RXLENERR */
#define IFX_ETH_RX_LENGTH_ERROR_FRAMES_RXLENERR_LEN (32)

/** \\brief  Mask for Ifx_ETH_RX_LENGTH_ERROR_FRAMES_Bits.RXLENERR */
#define IFX_ETH_RX_LENGTH_ERROR_FRAMES_RXLENERR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RX_LENGTH_ERROR_FRAMES_Bits.RXLENERR */
#define IFX_ETH_RX_LENGTH_ERROR_FRAMES_RXLENERR_OFF (0)

/** \\brief  Length for Ifx_ETH_RX_MULTICAST_FRAMES_GOOD_Bits.RXMCASTG */
#define IFX_ETH_RX_MULTICAST_FRAMES_GOOD_RXMCASTG_LEN (32)

/** \\brief  Mask for Ifx_ETH_RX_MULTICAST_FRAMES_GOOD_Bits.RXMCASTG */
#define IFX_ETH_RX_MULTICAST_FRAMES_GOOD_RXMCASTG_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RX_MULTICAST_FRAMES_GOOD_Bits.RXMCASTG */
#define IFX_ETH_RX_MULTICAST_FRAMES_GOOD_RXMCASTG_OFF (0)

/** \\brief  Length for Ifx_ETH_RX_OCTET_COUNT_GOOD_BAD_Bits.RXOCTGB */
#define IFX_ETH_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB_LEN (32)

/** \\brief  Mask for Ifx_ETH_RX_OCTET_COUNT_GOOD_BAD_Bits.RXOCTGB */
#define IFX_ETH_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RX_OCTET_COUNT_GOOD_BAD_Bits.RXOCTGB */
#define IFX_ETH_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB_OFF (0)

/** \\brief  Length for Ifx_ETH_RX_OCTET_COUNT_GOOD_Bits.RXOCTG */
#define IFX_ETH_RX_OCTET_COUNT_GOOD_RXOCTG_LEN (32)

/** \\brief  Mask for Ifx_ETH_RX_OCTET_COUNT_GOOD_Bits.RXOCTG */
#define IFX_ETH_RX_OCTET_COUNT_GOOD_RXOCTG_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RX_OCTET_COUNT_GOOD_Bits.RXOCTG */
#define IFX_ETH_RX_OCTET_COUNT_GOOD_RXOCTG_OFF (0)

/** \\brief  Length for Ifx_ETH_RX_OUT_OF_RANGE_TYPE_FRAMES_Bits.RXOUTOFRNG */
#define IFX_ETH_RX_OUT_OF_RANGE_TYPE_FRAMES_RXOUTOFRNG_LEN (32)

/** \\brief  Mask for Ifx_ETH_RX_OUT_OF_RANGE_TYPE_FRAMES_Bits.RXOUTOFRNG */
#define IFX_ETH_RX_OUT_OF_RANGE_TYPE_FRAMES_RXOUTOFRNG_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RX_OUT_OF_RANGE_TYPE_FRAMES_Bits.RXOUTOFRNG */
#define IFX_ETH_RX_OUT_OF_RANGE_TYPE_FRAMES_RXOUTOFRNG_OFF (0)

/** \\brief  Length for Ifx_ETH_RX_OVERSIZE_FRAMES_GOOD_Bits.RXOVERSZG */
#define IFX_ETH_RX_OVERSIZE_FRAMES_GOOD_RXOVERSZG_LEN (32)

/** \\brief  Mask for Ifx_ETH_RX_OVERSIZE_FRAMES_GOOD_Bits.RXOVERSZG */
#define IFX_ETH_RX_OVERSIZE_FRAMES_GOOD_RXOVERSZG_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RX_OVERSIZE_FRAMES_GOOD_Bits.RXOVERSZG */
#define IFX_ETH_RX_OVERSIZE_FRAMES_GOOD_RXOVERSZG_OFF (0)

/** \\brief  Length for Ifx_ETH_RX_PAUSE_FRAMES_Bits.RXPAUSEFRM */
#define IFX_ETH_RX_PAUSE_FRAMES_RXPAUSEFRM_LEN (32)

