keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEth_bf.h
/** \\brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSMSTRENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSMSTRENA_OFF (15)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSTRIG */
#define IFX_ETH_TIMESTAMP_CONTROL_TSTRIG_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSTRIG */
#define IFX_ETH_TIMESTAMP_CONTROL_TSTRIG_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSTRIG */
#define IFX_ETH_TIMESTAMP_CONTROL_TSTRIG_OFF (4)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSUPDT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSUPDT_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSUPDT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSUPDT_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSUPDT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSUPDT_OFF (3)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSVER2ENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSVER2ENA_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSVER2ENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSVER2ENA_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSVER2ENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSVER2ENA_OFF (10)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.ATSNS */
#define IFX_ETH_TIMESTAMP_STATUS_ATSNS_LEN (5)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.ATSNS */
#define IFX_ETH_TIMESTAMP_STATUS_ATSNS_MSK (0x1f)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.ATSNS */
#define IFX_ETH_TIMESTAMP_STATUS_ATSNS_OFF (25)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.ATSSTM */
#define IFX_ETH_TIMESTAMP_STATUS_ATSSTM_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.ATSSTM */
#define IFX_ETH_TIMESTAMP_STATUS_ATSSTM_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.ATSSTM */
#define IFX_ETH_TIMESTAMP_STATUS_ATSSTM_OFF (24)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.ATSSTN */
#define IFX_ETH_TIMESTAMP_STATUS_ATSSTN_LEN (4)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.ATSSTN */
#define IFX_ETH_TIMESTAMP_STATUS_ATSSTN_MSK (0xf)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.ATSSTN */
#define IFX_ETH_TIMESTAMP_STATUS_ATSSTN_OFF (16)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.AUXTSTRIG */
#define IFX_ETH_TIMESTAMP_STATUS_AUXTSTRIG_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.AUXTSTRIG */
#define IFX_ETH_TIMESTAMP_STATUS_AUXTSTRIG_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.AUXTSTRIG */
#define IFX_ETH_TIMESTAMP_STATUS_AUXTSTRIG_OFF (2)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSSOVF */
#define IFX_ETH_TIMESTAMP_STATUS_TSSOVF_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSSOVF */
#define IFX_ETH_TIMESTAMP_STATUS_TSSOVF_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSSOVF */
#define IFX_ETH_TIMESTAMP_STATUS_TSSOVF_OFF (0)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT1 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT1_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT1 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT1_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT1 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT1_OFF (4)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT2 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT2_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT2 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT2_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT2 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT2_OFF (6)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT3 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT3_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT3 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT3_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT3 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT3_OFF (8)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT_OFF (1)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR1 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR1_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR1 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR1_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR1 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR1_OFF (5)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR2 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR2_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR2 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR2_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR2 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR2_OFF (7)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR3 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR3_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR3 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR3_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR3 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR3_OFF (9)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR_OFF (3)

/** \\brief  Length for
 * Ifx_ETH_TRANSMIT_DESCRIPTOR_LIST_ADDRESS_Bits.TDESLA_32bit */
#define IFX_ETH_TRANSMIT_DESCRIPTOR_LIST_ADDRESS_TDESLA_32BIT_LEN (30)

/** \\brief  Mask for Ifx_ETH_TRANSMIT_DESCRIPTOR_LIST_ADDRESS_Bits.TDESLA_32bit */
#define IFX_ETH_TRANSMIT_DESCRIPTOR_LIST_ADDRESS_TDESLA_32BIT_MSK (0x3fffffff)

