keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEth_bf.h
/** \\brief  Offset for
 * Ifx_ETH_TRANSMIT_DESCRIPTOR_LIST_ADDRESS_Bits.TDESLA_32bit */
#define IFX_ETH_TRANSMIT_DESCRIPTOR_LIST_ADDRESS_TDESLA_32BIT_OFF (2)

/** \\brief  Length for Ifx_ETH_TRANSMIT_POLL_DEMAND_Bits.TPD */
#define IFX_ETH_TRANSMIT_POLL_DEMAND_TPD_LEN (32)

/** \\brief  Mask for Ifx_ETH_TRANSMIT_POLL_DEMAND_Bits.TPD */
#define IFX_ETH_TRANSMIT_POLL_DEMAND_TPD_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TRANSMIT_POLL_DEMAND_Bits.TPD */
#define IFX_ETH_TRANSMIT_POLL_DEMAND_TPD_OFF (0)

/** \\brief  Length for
 * Ifx_ETH_TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_Bits.TX1024_MAXOCTGB */
#define IFX_ETH_TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_TX1024_MAXOCTGB_LEN (32)

/** \\brief  Mask for
 * Ifx_ETH_TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_Bits.TX1024_MAXOCTGB */
#define IFX_ETH_TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_TX1024_MAXOCTGB_MSK (0xffffffff)

/** \\brief  Offset for
 * Ifx_ETH_TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_Bits.TX1024_MAXOCTGB */
#define IFX_ETH_TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_TX1024_MAXOCTGB_OFF (0)

/** \\brief  Length for
 * Ifx_ETH_TX_128TO255OCTETS_FRAMES_GOOD_BAD_Bits.TX128_255OCTGB */
#define IFX_ETH_TX_128TO255OCTETS_FRAMES_GOOD_BAD_TX128_255OCTGB_LEN (32)

/** \\brief  Mask for
 * Ifx_ETH_TX_128TO255OCTETS_FRAMES_GOOD_BAD_Bits.TX128_255OCTGB */
#define IFX_ETH_TX_128TO255OCTETS_FRAMES_GOOD_BAD_TX128_255OCTGB_MSK (0xffffffff)

/** \\brief  Offset for
 * Ifx_ETH_TX_128TO255OCTETS_FRAMES_GOOD_BAD_Bits.TX128_255OCTGB */
#define IFX_ETH_TX_128TO255OCTETS_FRAMES_GOOD_BAD_TX128_255OCTGB_OFF (0)

/** \\brief  Length for
 * Ifx_ETH_TX_256TO511OCTETS_FRAMES_GOOD_BAD_Bits.TX256_511OCTGB */
#define IFX_ETH_TX_256TO511OCTETS_FRAMES_GOOD_BAD_TX256_511OCTGB_LEN (32)

/** \\brief  Mask for
 * Ifx_ETH_TX_256TO511OCTETS_FRAMES_GOOD_BAD_Bits.TX256_511OCTGB */
#define IFX_ETH_TX_256TO511OCTETS_FRAMES_GOOD_BAD_TX256_511OCTGB_MSK (0xffffffff)

/** \\brief  Offset for
 * Ifx_ETH_TX_256TO511OCTETS_FRAMES_GOOD_BAD_Bits.TX256_511OCTGB */
#define IFX_ETH_TX_256TO511OCTETS_FRAMES_GOOD_BAD_TX256_511OCTGB_OFF (0)

/** \\brief  Length for
 * Ifx_ETH_TX_512TO1023OCTETS_FRAMES_GOOD_BAD_Bits.TX512_1023OCTGB */
#define IFX_ETH_TX_512TO1023OCTETS_FRAMES_GOOD_BAD_TX512_1023OCTGB_LEN (32)

/** \\brief  Mask for
 * Ifx_ETH_TX_512TO1023OCTETS_FRAMES_GOOD_BAD_Bits.TX512_1023OCTGB */
#define IFX_ETH_TX_512TO1023OCTETS_FRAMES_GOOD_BAD_TX512_1023OCTGB_MSK (0xffffffff)

/** \\brief  Offset for
 * Ifx_ETH_TX_512TO1023OCTETS_FRAMES_GOOD_BAD_Bits.TX512_1023OCTGB */
#define IFX_ETH_TX_512TO1023OCTETS_FRAMES_GOOD_BAD_TX512_1023OCTGB_OFF (0)

/** \\brief  Length for Ifx_ETH_TX_64OCTETS_FRAMES_GOOD_BAD_Bits.TX64OCTGB */
#define IFX_ETH_TX_64OCTETS_FRAMES_GOOD_BAD_TX64OCTGB_LEN (32)

/** \\brief  Mask for Ifx_ETH_TX_64OCTETS_FRAMES_GOOD_BAD_Bits.TX64OCTGB */
#define IFX_ETH_TX_64OCTETS_FRAMES_GOOD_BAD_TX64OCTGB_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TX_64OCTETS_FRAMES_GOOD_BAD_Bits.TX64OCTGB */
#define IFX_ETH_TX_64OCTETS_FRAMES_GOOD_BAD_TX64OCTGB_OFF (0)

/** \\brief  Length for
 * Ifx_ETH_TX_65TO127OCTETS_FRAMES_GOOD_BAD_Bits.TX65_127OCTGB */
#define IFX_ETH_TX_65TO127OCTETS_FRAMES_GOOD_BAD_TX65_127OCTGB_LEN (32)

/** \\brief  Mask for
 * Ifx_ETH_TX_65TO127OCTETS_FRAMES_GOOD_BAD_Bits.TX65_127OCTGB */
#define IFX_ETH_TX_65TO127OCTETS_FRAMES_GOOD_BAD_TX65_127OCTGB_MSK (0xffffffff)

/** \\brief  Offset for
 * Ifx_ETH_TX_65TO127OCTETS_FRAMES_GOOD_BAD_Bits.TX65_127OCTGB */
#define IFX_ETH_TX_65TO127OCTETS_FRAMES_GOOD_BAD_TX65_127OCTGB_OFF (0)

/** \\brief  Length for Ifx_ETH_TX_BROADCAST_FRAMES_GOOD_BAD_Bits.TXBCASTGB */
#define IFX_ETH_TX_BROADCAST_FRAMES_GOOD_BAD_TXBCASTGB_LEN (32)

/** \\brief  Mask for Ifx_ETH_TX_BROADCAST_FRAMES_GOOD_BAD_Bits.TXBCASTGB */
#define IFX_ETH_TX_BROADCAST_FRAMES_GOOD_BAD_TXBCASTGB_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TX_BROADCAST_FRAMES_GOOD_BAD_Bits.TXBCASTGB */
#define IFX_ETH_TX_BROADCAST_FRAMES_GOOD_BAD_TXBCASTGB_OFF (0)

/** \\brief  Length for Ifx_ETH_TX_BROADCAST_FRAMES_GOOD_Bits.TXBCASTG */
#define IFX_ETH_TX_BROADCAST_FRAMES_GOOD_TXBCASTG_LEN (32)

/** \\brief  Mask for Ifx_ETH_TX_BROADCAST_FRAMES_GOOD_Bits.TXBCASTG */
#define IFX_ETH_TX_BROADCAST_FRAMES_GOOD_TXBCASTG_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TX_BROADCAST_FRAMES_GOOD_Bits.TXBCASTG */
#define IFX_ETH_TX_BROADCAST_FRAMES_GOOD_TXBCASTG_OFF (0)

/** \\brief  Length for Ifx_ETH_TX_CARRIER_ERROR_FRAMES_Bits.TXCARR */
#define IFX_ETH_TX_CARRIER_ERROR_FRAMES_TXCARR_LEN (32)

/** \\brief  Mask for Ifx_ETH_TX_CARRIER_ERROR_FRAMES_Bits.TXCARR */
#define IFX_ETH_TX_CARRIER_ERROR_FRAMES_TXCARR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TX_CARRIER_ERROR_FRAMES_Bits.TXCARR */
#define IFX_ETH_TX_CARRIER_ERROR_FRAMES_TXCARR_OFF (0)

/** \\brief  Length for Ifx_ETH_TX_DEFERRED_FRAMES_Bits.TXDEFRD */
#define IFX_ETH_TX_DEFERRED_FRAMES_TXDEFRD_LEN (32)

/** \\brief  Mask for Ifx_ETH_TX_DEFERRED_FRAMES_Bits.TXDEFRD */
#define IFX_ETH_TX_DEFERRED_FRAMES_TXDEFRD_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TX_DEFERRED_FRAMES_Bits.TXDEFRD */
#define IFX_ETH_TX_DEFERRED_FRAMES_TXDEFRD_OFF (0)

/** \\brief  Length for Ifx_ETH_TX_EXCESSIVE_COLLISION_FRAMES_Bits.TXEXSCOL */
#define IFX_ETH_TX_EXCESSIVE_COLLISION_FRAMES_TXEXSCOL_LEN (32)

/** \\brief  Mask for Ifx_ETH_TX_EXCESSIVE_COLLISION_FRAMES_Bits.TXEXSCOL */
#define IFX_ETH_TX_EXCESSIVE_COLLISION_FRAMES_TXEXSCOL_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TX_EXCESSIVE_COLLISION_FRAMES_Bits.TXEXSCOL */
#define IFX_ETH_TX_EXCESSIVE_COLLISION_FRAMES_TXEXSCOL_OFF (0)

/** \\brief  Length for Ifx_ETH_TX_EXCESSIVE_DEFERRAL_ERROR_Bits.TXEXSDEF */
#define IFX_ETH_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF_LEN (32)

/** \\brief  Mask for Ifx_ETH_TX_EXCESSIVE_DEFERRAL_ERROR_Bits.TXEXSDEF */
#define IFX_ETH_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TX_EXCESSIVE_DEFERRAL_ERROR_Bits.TXEXSDEF */
#define IFX_ETH_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF_OFF (0)

/** \\brief  Length for Ifx_ETH_TX_FRAME_COUNT_GOOD_BAD_Bits.TXFRMGB */
#define IFX_ETH_TX_FRAME_COUNT_GOOD_BAD_TXFRMGB_LEN (32)

