keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEth_bf.h
/** \\brief  Mask for Ifx_ETH_TX_FRAME_COUNT_GOOD_BAD_Bits.TXFRMGB */
#define IFX_ETH_TX_FRAME_COUNT_GOOD_BAD_TXFRMGB_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TX_FRAME_COUNT_GOOD_BAD_Bits.TXFRMGB */
#define IFX_ETH_TX_FRAME_COUNT_GOOD_BAD_TXFRMGB_OFF (0)

/** \\brief  Length for Ifx_ETH_TX_FRAME_COUNT_GOOD_Bits.TXFRMG */
#define IFX_ETH_TX_FRAME_COUNT_GOOD_TXFRMG_LEN (32)

/** \\brief  Mask for Ifx_ETH_TX_FRAME_COUNT_GOOD_Bits.TXFRMG */
#define IFX_ETH_TX_FRAME_COUNT_GOOD_TXFRMG_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TX_FRAME_COUNT_GOOD_Bits.TXFRMG */
#define IFX_ETH_TX_FRAME_COUNT_GOOD_TXFRMG_OFF (0)

/** \\brief  Length for Ifx_ETH_TX_LATE_COLLISION_FRAMES_Bits.TXLATECOL */
#define IFX_ETH_TX_LATE_COLLISION_FRAMES_TXLATECOL_LEN (32)

/** \\brief  Mask for Ifx_ETH_TX_LATE_COLLISION_FRAMES_Bits.TXLATECOL */
#define IFX_ETH_TX_LATE_COLLISION_FRAMES_TXLATECOL_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TX_LATE_COLLISION_FRAMES_Bits.TXLATECOL */
#define IFX_ETH_TX_LATE_COLLISION_FRAMES_TXLATECOL_OFF (0)

/** \\brief  Length for Ifx_ETH_TX_MULTICAST_FRAMES_GOOD_BAD_Bits.TXMCASTGB */
#define IFX_ETH_TX_MULTICAST_FRAMES_GOOD_BAD_TXMCASTGB_LEN (32)

/** \\brief  Mask for Ifx_ETH_TX_MULTICAST_FRAMES_GOOD_BAD_Bits.TXMCASTGB */
#define IFX_ETH_TX_MULTICAST_FRAMES_GOOD_BAD_TXMCASTGB_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TX_MULTICAST_FRAMES_GOOD_BAD_Bits.TXMCASTGB */
#define IFX_ETH_TX_MULTICAST_FRAMES_GOOD_BAD_TXMCASTGB_OFF (0)

/** \\brief  Length for Ifx_ETH_TX_MULTICAST_FRAMES_GOOD_Bits.TXMCASTG */
#define IFX_ETH_TX_MULTICAST_FRAMES_GOOD_TXMCASTG_LEN (32)

/** \\brief  Mask for Ifx_ETH_TX_MULTICAST_FRAMES_GOOD_Bits.TXMCASTG */
#define IFX_ETH_TX_MULTICAST_FRAMES_GOOD_TXMCASTG_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TX_MULTICAST_FRAMES_GOOD_Bits.TXMCASTG */
#define IFX_ETH_TX_MULTICAST_FRAMES_GOOD_TXMCASTG_OFF (0)

/** \\brief  Length for
 * Ifx_ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES_Bits.TXMULTCOLG */
#define IFX_ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES_TXMULTCOLG_LEN (32)

/** \\brief  Mask for Ifx_ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES_Bits.TXMULTCOLG */
#define IFX_ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES_TXMULTCOLG_MSK (0xffffffff)

/** \\brief  Offset for
 * Ifx_ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES_Bits.TXMULTCOLG */
#define IFX_ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES_TXMULTCOLG_OFF (0)

/** \\brief  Length for Ifx_ETH_TX_OCTET_COUNT_GOOD_BAD_Bits.TXOCTGB */
#define IFX_ETH_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB_LEN (32)

/** \\brief  Mask for Ifx_ETH_TX_OCTET_COUNT_GOOD_BAD_Bits.TXOCTGB */
#define IFX_ETH_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TX_OCTET_COUNT_GOOD_BAD_Bits.TXOCTGB */
#define IFX_ETH_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB_OFF (0)

/** \\brief  Length for Ifx_ETH_TX_OCTET_COUNT_GOOD_Bits.TXOCTG */
#define IFX_ETH_TX_OCTET_COUNT_GOOD_TXOCTG_LEN (32)

/** \\brief  Mask for Ifx_ETH_TX_OCTET_COUNT_GOOD_Bits.TXOCTG */
#define IFX_ETH_TX_OCTET_COUNT_GOOD_TXOCTG_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TX_OCTET_COUNT_GOOD_Bits.TXOCTG */
#define IFX_ETH_TX_OCTET_COUNT_GOOD_TXOCTG_OFF (0)

/** \\brief  Length for Ifx_ETH_TX_OSIZE_FRAMES_GOOD_Bits.TXOSIZG */
#define IFX_ETH_TX_OSIZE_FRAMES_GOOD_TXOSIZG_LEN (32)

/** \\brief  Mask for Ifx_ETH_TX_OSIZE_FRAMES_GOOD_Bits.TXOSIZG */
#define IFX_ETH_TX_OSIZE_FRAMES_GOOD_TXOSIZG_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TX_OSIZE_FRAMES_GOOD_Bits.TXOSIZG */
#define IFX_ETH_TX_OSIZE_FRAMES_GOOD_TXOSIZG_OFF (0)

/** \\brief  Length for Ifx_ETH_TX_PAUSE_FRAMES_Bits.TXPAUSE */
#define IFX_ETH_TX_PAUSE_FRAMES_TXPAUSE_LEN (32)

/** \\brief  Mask for Ifx_ETH_TX_PAUSE_FRAMES_Bits.TXPAUSE */
#define IFX_ETH_TX_PAUSE_FRAMES_TXPAUSE_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TX_PAUSE_FRAMES_Bits.TXPAUSE */
#define IFX_ETH_TX_PAUSE_FRAMES_TXPAUSE_OFF (0)

/** \\brief  Length for Ifx_ETH_TX_SINGLE_COLLISION_GOOD_FRAMES_Bits.TXSNGLCOLG */
#define IFX_ETH_TX_SINGLE_COLLISION_GOOD_FRAMES_TXSNGLCOLG_LEN (32)

/** \\brief  Mask for Ifx_ETH_TX_SINGLE_COLLISION_GOOD_FRAMES_Bits.TXSNGLCOLG */
#define IFX_ETH_TX_SINGLE_COLLISION_GOOD_FRAMES_TXSNGLCOLG_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TX_SINGLE_COLLISION_GOOD_FRAMES_Bits.TXSNGLCOLG */
#define IFX_ETH_TX_SINGLE_COLLISION_GOOD_FRAMES_TXSNGLCOLG_OFF (0)

/** \\brief  Length for Ifx_ETH_TX_UNDERFLOW_ERROR_FRAMES_Bits.TXUNDRFLW */
#define IFX_ETH_TX_UNDERFLOW_ERROR_FRAMES_TXUNDRFLW_LEN (32)

/** \\brief  Mask for Ifx_ETH_TX_UNDERFLOW_ERROR_FRAMES_Bits.TXUNDRFLW */
#define IFX_ETH_TX_UNDERFLOW_ERROR_FRAMES_TXUNDRFLW_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TX_UNDERFLOW_ERROR_FRAMES_Bits.TXUNDRFLW */
#define IFX_ETH_TX_UNDERFLOW_ERROR_FRAMES_TXUNDRFLW_OFF (0)

/** \\brief  Length for Ifx_ETH_TX_UNICAST_FRAMES_GOOD_BAD_Bits.TXUCASTGB */
#define IFX_ETH_TX_UNICAST_FRAMES_GOOD_BAD_TXUCASTGB_LEN (32)

/** \\brief  Mask for Ifx_ETH_TX_UNICAST_FRAMES_GOOD_BAD_Bits.TXUCASTGB */
#define IFX_ETH_TX_UNICAST_FRAMES_GOOD_BAD_TXUCASTGB_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TX_UNICAST_FRAMES_GOOD_BAD_Bits.TXUCASTGB */
#define IFX_ETH_TX_UNICAST_FRAMES_GOOD_BAD_TXUCASTGB_OFF (0)

/** \\brief  Length for Ifx_ETH_TX_VLAN_FRAMES_GOOD_Bits.TXVLANG */
#define IFX_ETH_TX_VLAN_FRAMES_GOOD_TXVLANG_LEN (32)

/** \\brief  Mask for Ifx_ETH_TX_VLAN_FRAMES_GOOD_Bits.TXVLANG */
#define IFX_ETH_TX_VLAN_FRAMES_GOOD_TXVLANG_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TX_VLAN_FRAMES_GOOD_Bits.TXVLANG */
#define IFX_ETH_TX_VLAN_FRAMES_GOOD_TXVLANG_OFF (0)

/** \\brief  Length for Ifx_ETH_VERSION_Bits.SNPSVER */
#define IFX_ETH_VERSION_SNPSVER_LEN (8)

/** \\brief  Mask for Ifx_ETH_VERSION_Bits.SNPSVER */
#define IFX_ETH_VERSION_SNPSVER_MSK (0xff)

/** \\brief  Offset for Ifx_ETH_VERSION_Bits.SNPSVER */
#define IFX_ETH_VERSION_SNPSVER_OFF (0)

/** \\brief  Length for Ifx_ETH_VERSION_Bits.USERVER */
#define IFX_ETH_VERSION_USERVER_LEN (8)

