keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEth_bf.h
/** \\brief  Mask for Ifx_ETH_VERSION_Bits.USERVER */
#define IFX_ETH_VERSION_USERVER_MSK (0xff)

/** \\brief  Offset for Ifx_ETH_VERSION_Bits.USERVER */
#define IFX_ETH_VERSION_USERVER_OFF (8)

/** \\brief  Length for Ifx_ETH_VLAN_TAG_Bits.ESVL */
#define IFX_ETH_VLAN_TAG_ESVL_LEN (1)

/** \\brief  Mask for Ifx_ETH_VLAN_TAG_Bits.ESVL */
#define IFX_ETH_VLAN_TAG_ESVL_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_VLAN_TAG_Bits.ESVL */
#define IFX_ETH_VLAN_TAG_ESVL_OFF (18)

/** \\brief  Length for Ifx_ETH_VLAN_TAG_Bits.ETV */
#define IFX_ETH_VLAN_TAG_ETV_LEN (1)

/** \\brief  Mask for Ifx_ETH_VLAN_TAG_Bits.ETV */
#define IFX_ETH_VLAN_TAG_ETV_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_VLAN_TAG_Bits.ETV */
#define IFX_ETH_VLAN_TAG_ETV_OFF (16)

/** \\brief  Length for Ifx_ETH_VLAN_TAG_Bits.VL */
#define IFX_ETH_VLAN_TAG_VL_LEN (16)

/** \\brief  Mask for Ifx_ETH_VLAN_TAG_Bits.VL */
#define IFX_ETH_VLAN_TAG_VL_MSK (0xffff)

/** \\brief  Offset for Ifx_ETH_VLAN_TAG_Bits.VL */
#define IFX_ETH_VLAN_TAG_VL_OFF (0)

/** \\brief  Length for Ifx_ETH_VLAN_TAG_Bits.VTHM */
#define IFX_ETH_VLAN_TAG_VTHM_LEN (1)

/** \\brief  Mask for Ifx_ETH_VLAN_TAG_Bits.VTHM */
#define IFX_ETH_VLAN_TAG_VTHM_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_VLAN_TAG_Bits.VTHM */
#define IFX_ETH_VLAN_TAG_VTHM_OFF (19)

/** \\brief  Length for Ifx_ETH_VLAN_TAG_Bits.VTIM */
#define IFX_ETH_VLAN_TAG_VTIM_LEN (1)

/** \\brief  Mask for Ifx_ETH_VLAN_TAG_Bits.VTIM */
#define IFX_ETH_VLAN_TAG_VTIM_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_VLAN_TAG_Bits.VTIM */
#define IFX_ETH_VLAN_TAG_VTIM_OFF (17)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXETH_BF_H */
